[
  {
    "id": "baqarah-opening",
    "title": "Unlocking Surah al-Baqarah’s Opening Verses",
    "summary": "A close reading of the surah’s first seven verses, focusing on the balance of mercy, warning, and law.",
    "content": "<p>The first verses of <strong>Surah al-Baqarah</strong> unfold like a mosaic built from guidance, warning, and confirmation. The transition from the <em>Muqattaʿat</em> to the declaration “This is the Book about which there is no doubt” is deliberate; it signals a movement from divine mystery to rational clarity.</p>\n<p>The emphasis on <em>al-muttaqīn</em> establishes that the Qurʾān functions as both a warning and a reminder for those who fear Allah. Later jurisprudential passages in the surah—especially verses 284-286—show that fear and mercy are in balance; the believer is not overwhelmed by divine commands but reminded of Allah’s mercy, which is the anchor for lawful living.</p>\n<p>Understanding the historical backdrop reveals how the opening guided early Muslims through the qibla shift, economic hardship, and debates with the People of the Book. Each phrase responds to a specific need—clarity for the hesitant, resolve for the righteous, and consolation for the oppressed.</p>",
    "tags": ["Tafsir", "Qur'an", "Law"],
    "references": [
      {
        "label": "Tafsir Ibn Kathir",
        "url": "https://tafsir.com/",
        "detail": "Classical explanation of verses 1-7."
      },
      {
        "label": "Qur’an & the Law (Mawdudi)",
        "detail": "Essay on mercy, legislation, and the believer’s responsibilities."
      }
    ],
    "images": [
      "https://images.unsplash.com/photo-1507679799987-c73779587ccf?auto=format&fit=crop&w=1200&q=80"
    ]
  },
  {
    "id": "nur-linguistics",
    "title": "Linguistic Balance in Surah An-Nur",
    "summary": "How verb repetition and story placement keep social ethics, evidence, and repentance coherent.",
    "content": "<p><strong>Surah An-Nur</strong> is one of the most methodically structured chapters concerning etiquette, testimony, and social ethics. The surah weaves legal rulings in the middle with narrative reminders at both ends. That rhetoric makes the legislation feel like the natural culmination of moral storytelling.</p>\n<p>The Qurʾānic verb patterns—such as the repeated command <em>faʿalū</em> (“do it”)—are spaced precisely where the surah transitions from describing excesses to prescribing corrective behavior. A reader sees that the divine corrective emerges directly after a story of gossip or a leap of judgment, reinforcing that the law is not abstract but mends actual social fractures.</p>\n<p>Verse 26 contrasts false accusations with Allah’s kindness to the repentant. Its placement between sections on evidence and punishment serves as a reminder that accountability must include rehabilitation, not only deterrence.</p>",
    "tags": ["Tafsir", "Social Ethics"],
    "references": [
      {
        "label": "Tafsir al-Jalalayn",
        "detail": "Notes on the surah’s narrative structure."
      }
    ],
    "images": []
  }
]

